"""
Текстовые константы интерфейса бота.

Вход:
- не требуется.

Выход:
- готовые человекочитаемые сообщения для Telegram-хендлеров.
"""

# phrases.py

REQUEST_CONTACT_MESSAGE = "Пожалуйста, поделитесь своим контактом, нажав на кнопку 'Поделиться контактом' ниже."
THANK_YOU_CONTACT_MESSAGE = "Спасибо за предоставленную информацию о контакте!"
FAILED_TO_GET_CONTACT_MESSAGE = "К сожалению, не удалось получить информацию о вашем контакте. Пожалуйста, попробуйте еще раз."
SOMETHING_WENT_WRONG_MESSAGE = "Что-то пошло не так при получении вашего контакта. Попробуйте еще раз, пожалуйста."
USERNAME_MESSAGE = "Пожалуйста, введите имя пользователя в настройках телеграм (настройки - мой аккаунт - имя пользователя), затем снова нажмите /start."

OLD_USER = ""